nope, that didnt work, its still taking in default values and still trying to setup adaptive_protection_config block

my code:
```
module "edge_security_policy" {
  source = "GoogleCloudPlatform/cloud-armor/google"

  project_id                           = var.gcp_project_id
  name                                 = "geolocation-allowlist"
  description                          = "Only certain regions can access"
  default_rule_action                  = "deny(403)"
  type                                 = "CLOUD_ARMOR_EDGE"
  layer_7_ddos_defense_rule_visibility = "STANDARD"
  
  custom_rules = {
    allow_specific_regions = {
      action   = "allow"
      priority = 1
      # prod then allow US 
      # non-prod then allow US and Canada
      description = var.env == "production" ? "Only allow from US  : "Only allow from US, Canada"
      expression  = var.env == "production" ? "origin.region_code == 'US'" :   "origin.region_code == 'US' || origin.region_code == 'CA'"
    }
  }
}

Terraform plan
```
# module.rx2.module.edge_security_policy.google_compute_security_policy.policy will be created
  + resource "google_compute_security_policy" "policy" {
      + description = "Only certain regions can access"
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "geolocation-allowlist"
      + project     = "staging-service"
      + self_link   = (known after apply)
      + type        = "CLOUD_ARMOR_EDGE"

      + adaptive_protection_config {

          + layer_7_ddos_defense_config {
              + enable          = true
              + rule_visibility = "STANDARD"
            }
        }

      + advanced_options_config {
          + json_parsing = "DISABLED"
          + log_level    = "NORMAL"

          + json_custom_config {
              + content_types = (known after apply)
            }
        }

      + rule {
          + action      = "allow"
          + description = "Only allow from US, Canada"
          + preview     = false
          + priority    = 1

          + match {

              + expr {
                  + expression = "origin.region_code == 'CA' || origin.region_code == 'US'"
                }
            }
        }
      + rule {
          + action      = "deny(403)"
          + description = "Default rule, higher priority overrides it"
          + preview     = (known after apply)
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
    }
    
    Here message:
    ```
│ Error: Error creating SecurityPolicy: googleapi: Error 400: Invalid value for field 'resource.advancedOptionsConfig': '{  "jsonParsing": "DISABLED",  "logLevel": "NORMAL",  "jsonCustomConfig": {  }}'. Advanced options for Cloud Armor are currently only supported for security policies with CLOUD_ARMOR type., invalid
│
```

Looks like its not really setting variables in adaptive_protection_config block to null but using default values from json_parsing, log_level, and json_custom_config_content_types